tirdon/SwiftMatter/sdkconfig.defaults.wifi
CONFIG_IDF_TARGET="esp32c6"

# --- Network: WiFi ------------------------------------------------------
CONFIG_ENABLE_WIFI_STATION=y
CONFIG_ENABLE_WIFI_AP=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_DEFAULT_WIFI_SSID="Boy1212  2.4G"
CONFIG_DEFAULT_WIFI_PASSWORD="0620380499"
CONFIG_WIFI_STATION_RECONNECT_INTERVAL=1000
CONFIG_MAX_SCAN_NETWORKS_RESULTS=3000
CONFIG_WIFI_SCAN_COMPLETION_TIMEOUT=10000

# --- LwIP ---------------------------------------------------------------
CONFIG_LWIP_LOCAL_HOSTNAME="IrrigationController"
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=6

# --- mDNS (minimal mDNS for WiFi) --------------------------------------
CONFIG_USE_MINIMAL_MDNS=y
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# --- MbedTLS ------------------------------------------------------------
CONFIG_MBEDTLS_HKDF_C=y

# --- BLE ----------------------------------------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=70
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=n
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=y

# --- Matter / CHIP ------------------------------------------------------
CONFIG_ENABLE_CHIP_SHELL=y
CONFIG_ENABLE_OTA_REQUESTOR=y
CONFIG_ESP_MATTER_NVS_USE_COMPACT_ATTR_STORAGE=y
CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL=n
CONFIG_CHIP_ENABLE_BDX_LOG_TRANSFER=y
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# --- Flash & serial -----------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_BAUD_921600B=y
CONFIG_ESPTOOLPY_BAUD=921600
CONFIG_ESPTOOLPY_COMPRESSED=y
CONFIG_ESPTOOLPY_MONITOR_BAUD_115200B=y
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200

# --- Partition table ----------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xC000

# --- FreeRTOS -----------------------------------------------------------
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# --- Stack sizes (Embedded Swift needs larger stacks) -------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_CHIP_TASK_STACK_SIZE=16384
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# --- Board: ESP32-C6 DevKit --------------------------------------------
# CONFIG_BSP_BUTTONS_NUM=1
# CONFIG_BSP_BUTTON_1_TYPE_GPIO=y
# CONFIG_BSP_BUTTON_1_GPIO=0
# CONFIG_BSP_BUTTON_1_LEVEL=0
# CONFIG_BSP_LEDS_NUM=0
# CONFIG_BUTTON_PERIOD_TIME_MS=20
# CONFIG_BUTTON_LONG_PRESS_TIME_MS=5000

# --- Debug --------------------------------------------------------------
CONFIG_ESP32_ENABLE_COREDUMP_TO_FLASH=y
CONFIG_ESP32_COREDUMP_DATA_FORMAT_ELF=y
